* DONE Create a Stdio-transport based server implementation
* DONE Create a template project for easily creating MCP servers
CLOSED: [2025-04-27 Sun 18:30]
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-04-27 Sun 18:30]
- State "TODO"       from              [2025-04-27 Sun 18:28]
:END:
See:
1. [[https://github.com/unravel-team/mcp-clojure-server-deps-new][mcp-clojure-server-deps-new]] for a ~deps-new~ based template
2. [[https://github.com/unravel-team/example-cool-mcp-server][example-cool-mcp-server]] for a Github template project
* DONE Add client support to mcp-clojure-sdk
CLOSED: [2025-05-25 Sun]
:LOGBOOK:
- State "DONE"       from "WORKING"    [2025-05-25 Sun]
- State "WORKING"    from "TODO"       [2025-05-24 Sat 14:38]
:END:
** DONE Add basic client support for the stdio transport, based on what python-sdk and typescript-sdk do
CLOSED: [2025-05-25 Sun]
:LOGBOOK:
- State "DONE"       from "WORKING"    [2025-05-25 Sun]
- State "WORKING"    from "TODO"       [2025-05-24 Sat 14:38]
:END:
:CLOCK:
CLOCK: [2025-05-25 Sun 11:07]--[2025-05-25 Sun 11:41] =>  0:34
CLOCK: [2025-05-24 Sat 14:38]--[2025-05-25 Sun 08:29] => 17:51
:END:
** DONE Create an integration test for the current server code using such a client, based on clojure-lsp integration tests
CLOSED: [2025-05-25 Sun]
:LOGBOOK:
- State "DONE"       from "WORKING"    [2025-05-25 Sun]
- State "WORKING"    from "TODO"       [2025-05-25 Sun 11:41]
:END:
:CLOCK:
CLOCK: [2025-05-25 Sun 11:41]--[2025-05-25 Sun 12:32] =>  0:51
:END:

* DONE Update the README of mcp-clojure-sdk.
CLOSED: [2025-05-25 Sun]

* TODO Write an example mcp-client-tool to run mcp-servers locally and list what they do/don't provide
** TODO Support servers launched using npx/node
** TODO Support servers launched using uv/python
** TODO Support servers launched using java
* DONE Add support for dynamic server capability negotiation
CLOSED: [2025-05-25 Sun]
* TODO Add support for the SSE / Streaming HTTP transport to mcp-clojure-sdk
** TODO Add support for SSE transport
** TODO Add support for Streaming HTTP transport

* DONE Implement the entire roots section of the protocol
CLOSED: [2025-05-25 Sun]
:LOGBOOK:
- State "DONE"       from "WORKING"    [2025-05-25 Sun]
- State "WORKING"    from "TODO"       [2025-05-03 Sat 16:38]
:END:
* DONE Bring the spec up-to-date and track the differences
CLOSED: [2025-05-25 Sun]

* DONE Add an integration test for end-to-end testing the server
CLOSED: [2025-05-25 Sun]
* TODO Implement the HTTP-SSE Transport
** TODO Implement the SSE-transport based server
** TODO Implement the SSE-transport based client
* WORKING Checks and Balances in the mcp-cljc-sdk code
** DONE Make sure that handle-* functions implement proper checks
CLOSED: [2026-03-21 Sat]
Added invalid-params validation (-32602) for tools/call, resources/read, prompts/get.
Error handling for handler exceptions in tool/resource/prompt handlers.
** DONE Add response helpers for building well-formed responses
CLOSED: [2026-03-21 Sat]
text-content, image-content, tool-error, prompt-message helper functions.
** DONE Add cursor-based pagination to list handlers
CLOSED: [2026-03-21 Sat]
** DONE Add registration/deregistration API with capability cleanup
CLOSED: [2026-03-21 Sat]
deregister-tool!, deregister-resource!, deregister-prompt!, deregister-resource-template!, deregister-completion!
** DONE Add configurable page-size to server context
CLOSED: [2026-03-21 Sat]
** DONE Add progress notifications and cancellation tracking
CLOSED: [2026-03-21 Sat]
notify-progress!, cancelled?, clear-cancelled!
** DONE Add resource template URI matching for resources/read
CLOSED: [2026-03-21 Sat]
Templates with :handler can resolve URIs matching the template pattern.
** TODO Ensure that error handling is correctly done for transports
** TODO Implement best practices for transports
* DONE Implement the entire sampling section of the protocol
CLOSED: [2025-05-25 Sun]
* TODO Create a CLI tool for how tools, prompts, resources should be defined
1. Easily create new projects, in ~deps-new~ style
2. Organize them properly, making it possible to build servers fast.
3. Make it language-agnostic, allowing the tool to create Clojure, Python, TS projects.
* TODO Explore babashka as the runner in Claude Desktop / Inspector
The current code is wildly incompatible with bb, so this is a long-shot. But bb compatibility will mean speed and ease of use.
